import Image from "next/image"
import img from "@/shared/assets/images/instructia.svg" 
import { FooterFormWidget } from "@/modules/footer-form";

export default function Instruktsiia() {
  return (
    <>
    

      <div className="max-w-[1130px] w-full m-auto py-[70px] px-4">
        <div className="relative w-full md:h-[400px] h-[200px]">
        <Image src={img} fill alt="quickdecor" className="object-contain "  />
        </div>
        
        <div className="max-w-[700px] w-full m-auto py-[30px] md:py-[70px] pb-0 text-sm">
          <p className="mb-4">  Для початку необхідно виміряти висоту і ширину всіх стін, після чого скористатися досить
            простою математичною формулою « <b>S</b> = <b>H</b> × <b>L</b>», де Н - це висота стіни, <b>L</b> - її довжина, ну а 
            <b> S</b> - відповідно необхідна нам площа.</p>
          <p className="mb-4">Однак, перед складанням точного розрахунку площі стін, необхідно врахувати особливості
            приміщення (кількість вікон, дверей, виступів і поглиблень). Для того щоб виключити площу
            вікон і дверей, необхідно скористатися тією ж формулою що при розрахунку основної площі,
            однак, тепер в якості даних використовувати ширину і висоту самих отворів і поглиблень.
            Після цього отриманий результат необхідно просто відняти від загального.</p>

          <h2 className="text-[#ff0000] font-bold text-lg pb-[12px]">РОЗРАХУНОК ЗА ПРИКЛАДОМ</h2>
          <ul>
            <li><b>Периметр кімнати</b>: <b>3,2</b>м + <b>3,2</b>м (ширина) + <b>5,6</b>м + <b>5,6</b>м (довжина) = <b>17,6</b>м</li>
            <li><b>Площа стін кімнати</b>: <b>17,6</b>м (периметр) × <b>2,5</b>м (висота) = <b>44</b>м2</li>
            <li><b>Площа віконних і дверних прорізів</b>: <b>2,1</b>м × <b>0,9</b>м (двері) + <b>1,3</b>м × <b>1,42</b>м (вікно) = <b>3,7</b>м2</li>
            <li><b>Площа стін кімнати за вирахуванням вікон і дверей</b>: <b>44</b>м2 - <b>3,7</b> м2 = <b>40,3</b>м2</li>
          </ul>

        </div>
      </div>
    
    
      <FooterFormWidget />
    </>
  
  );
}
